{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "CNN_Lenguaje_Senas",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                64,
                64,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer",
              "optional": false
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "Convolucion_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "Pooling_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "Convolucion_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "Pooling_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "Aplanado",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [
          null,
          64,
          64,
          1
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "Convolucion_1/kernel",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolucion_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolucion_2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolucion_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            12544,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}